src/Reports/ЗатратыВремени/ЗатратыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗатратыВремени</name>
</mdclass:Report>

src/Catalogs/КатегорииОтчетов/КатегорииОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииОтчетов</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>?</description>
    </items>
    <items>
      <name>Администрирование</name>
      <description>Администрирование</description>
    </items>
    <items>
      <name>ПоВнутреннимДокументам</name>
      <description>Внутренние документы</description>
    </items>
    <items>
      <name>ПоВходящимДокументам</name>
      <description>Входящие документы</description>
    </items>
    <items>
      <name>ПоИсходящимДокументам</name>
      <description>Исходящие документы</description>
    </items>
    <items>
      <name>КонтрольныеОтчеты</name>
      <description>Контрольные</description>
    </items>
    <items>
      <name>Просроченное</name>
      <description>О просрочке</description>
    </items>
    <items>
      <name>ПоОбращениямГраждан</name>
      <description>Обращения граждан</description>
    </items>
    <items>
      <name>ПерсональныеДанные</name>
      <description>Персональные данные</description>
    </items>
    <items>
      <name>ПланФакт</name>
      <description>План-факт</description>
    </items>
    <items>
      <name>ПоДокументам</name>
      <description>По всем документам</description>
    </items>
    <items>
      <name>ПоДоговорам</name>
      <description>По договорам</description>
    </items>
    <items>
      <name>ПоЗадачамИПроцессам</name>
      <description>По задачам и процессам</description>
    </items>
    <items>
      <name>ПоИсполнителям</name>
      <description>По исполнителям</description>
    </items>
    <items>
      <name>ПоКонтрагентам</name>
      <description>По контрагентам</description>
    </items>
    <items>
      <name>ПоМероприятиям</name>
      <description>По мероприятиям</description>
    </items>
    <items>
      <name>ПоПроектам</name>
      <description>По проектам</description>
    </items>
    <items>
      <name>Почта</name>
      <description>Почта</description>
    </items>
    <items>
      <name>Статистические</name>
      <description>Статистические</description>
    </items>
    <items>
      <name>ЭДО</name>
      <description>ЭДО</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/ЗатратыВремени/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область НастройкиОтчетаПоУмолчанию

//Выполняет заполнение категорий и разделов в зависимости от варианта отчета
//Параметры:КлючВариантаОтчета - Строковое название варианта отчета
//			СписокКатегорий - в список добавляются необходимые категории
//			СписокРазделов - в список добавляются необходимые категории
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.УчетВремени));
			
	Если КлючВариантаОтчета = "ПоВидамРабот" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		
	ИначеЕсли КлючВариантаОтчета = "ПоПодразделениям" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		
	ИначеЕсли КлючВариантаОтчета = "СтатистикаПоВидамРабот" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Статистические);
		
	ИначеЕсли КлючВариантаОтчета = "МоиЗатраты" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		
	ИначеЕсли КлючВариантаОтчета = "ТабельРабочегоВремени" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		
	ИначеЕсли КлючВариантаОтчета = "СтатистикаПоПроектам" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоПроектам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Статистические);
		
	ИначеЕсли КлючВариантаОтчета = "ПоПроектам" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоПроектам);
		
	ИначеЕсли КлючВариантаОтчета = "РабочееВремяСотрудниковПодразделения" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		
	ИначеЕсли КлючВариантаОтчета = "ДинамикаРабочегоВремени" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		
	ИначеЕсли КлючВариантаОтчета = "РабочееВремяПодразделений" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
